In [1]:
# installing pandas

!pip install pandas

Requirement already satisfied: pandas in /Users/mh067948/miniconda3/lib/python3.7/site-packages (0.24.1)
Requirement already satisfied: python-dateutil>=2.5.0 in /Users/mh067948/miniconda3/lib/python3.7/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2011k in /Users/mh067948/miniconda3/lib/python3.7/site-packages (from pandas) (2018.9)
Requirement already satisfied: numpy>=1.12.0 in /Users/mh067948/miniconda3/lib/python3.7/site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in /Users/mh067948/miniconda3/lib/python3.7/site-packages (from python-dateutil>=2.5.0->pandas) (1.12.0)

import pandas as pd

In [41]:
# create a DataFrame like this
df = pd.DataFrame({
    'name': ["John","Dave","Steve","Amy"],
    'gender': ["Male","Male","Male","Female"],
    'age': [25,29,30,31]
})

df

    name  gender  age
0   John    Male   25
1   Dave    Male   29
2  Steve    Male   30
3    Amy  Female   31

In [42]:
# or from .csv
data = pd.read_csv("data.csv")

data

    name  gender  age
0   John    Male   25
1   Dave    Male   29
2  Steve    Male   30
3    Amy  Female   31

In [43]:
df.describe(include='all')

       name gender        age
count     4      4   4.000000
unique    4      2        NaN
top     Amy   Male        NaN
freq      1      3        NaN
mean    NaN    NaN  28.750000
std     NaN    NaN   2.629956
min     NaN    NaN  25.000000
25%     NaN    NaN  28.000000
50%     NaN    NaN  29.500000
75%     NaN    NaN  30.250000
max     NaN    NaN  31.000000

In [44]:
# get subset of data

subset = data[['name','age']]

subset

    name  age
0   John   25
1   Dave   29
2  Steve   30
3    Amy   31

In [45]:
# group by 

groupby_df = data.groupby(by="gender").count()

groupby_df

        name  age
gender
Female     1    1
Male       3    3

In [28]:
# aggregation

data['age'].min()

25

In [31]:
data['age'].max()

31

In [32]:
data['age'].mean()

28.75

In [33]:
data['age'].std()

2.6299556396765835

In [46]:
# multiple aggregationo functions in one line for all columns
data.agg(['sum', 'min','max','mean','std'])

                  name              gender         age
sum   JohnDaveSteveAmy  MaleMaleMaleFemale  115.000000
min                Amy              Female   25.000000
max              Steve                Male   31.000000
mean               NaN                 NaN   28.750000
std                NaN                 NaN    2.629956

In [47]:
# multiple aggregationo functions in one line for a single column
data['age'].agg(['sum', 'min','max','mean','std'])

sum     115.000000
min      25.000000
max      31.000000
mean     28.750000
std       2.629956
Name: age, dtype: float64